Page({

  /**
   * 页面的初始数据
   */
  data: {
    title: '申请企业减脂营',
    htmlSnip: '深圳市维士智慧健康管理有限公司 （以下简称“维士”) 是国内首家基于大数据技术和数字化手段，为个人提供精准营养、合理膳食和健康管理的互联网企业。<br/>主要是通过自主研发的功能性APP和小程序，对用户的基础身体数据、基础代谢数据、运动及日常消耗数据、 食物及营养摄入数据、体检医检数据，以智能AI精准算法开展综合性专业分析，形成针对个人的基于蛋白质、 碳水化合物、脂肪等为主要成分指数的配餐方案，并由维士大型中央厨房直接提供个性化的配餐服务。 这是全球首次将个人营养数据和大型数字化配餐系统相融合，通过线上输入数据和预定餐食、线下精准配餐和高效配送的方式，实现“千人千餐”的饮食模式。<br/><br/>维士积极践行《健康中国行动（2019-2030年）》及《中国居民膳食指南（2016）》精神， 以“合理膳食， 健康基石”为宗旨，倡导“食香味数”的饮食文化，在不改变中国人基础饮食结构的前提下， 以数字化技术创造科学、精准、安全的饮食方式，提高人民群众健康水平，开创中国饮食新时代。'
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function(options){
    // return {
    //   title: '维士健身饮食，健康美味！',
    //   path: '/pages/index/index',
    //   imageUrl: "https://prodstatic.weis1606.cn/api/mini/small_program_share.png",
    //   success: (res) => {
        
    //   },
    //   fail: (res) => {
        
    //   }
    // }
  }
})